Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

1.read_csv

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
df.loc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [5]:
import pandas as pd

def reindex_dataframe(df1):
    new_index = pd.Index(range(1, len(df1) * 2, 2))
    df1 = df1.reset_index(drop=True)
    df1.index = new_index
    return df1

In [7]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
reindexed_df1= reindex_dataframe(df1)
print(reindexed_df1)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

In [8]:
len(df1)

3

In [13]:
data=pd.DataFrame({'marks':[10,20,30]})

You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [16]:
import pandas as pd

def calculate_sum(df):
    sum_values = sum(df['Values'].head(3))
    print("Sum of the first three values:", sum_values)

In [17]:
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
calculate_sum(df)

Sum of the first three values: 60

Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [18]:
import pandas as pd

def count_words(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))
    return df

In [19]:
df = pd.DataFrame({'Text': ['Hello, how are you?', 'I am doing well.', 'Python programming is fun.']})
df = count_words(df)
print(df)

                         Text  Word_Count
0         Hello, how are you?           4
1            I am doing well.           4
2  Python programming is fun.           4

In [20]:
import pandas as pd

def count_words(df):
    df['Word_Count'] = df['Text'].str.count('\S+')
    return df

In [21]:
df = pd.DataFrame({'Text': ['Hello, how are you?', 'I am doing well.', 'Python programming is fun.']})
df = count_words(df)
print(df)

                         Text  Word_Count
0         Hello, how are you?           4
1            I am doing well.           4
2  Python programming is fun.           4

How are DataFrame.size() and DataFrame.shape() different?

In [22]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

print(df.size)  # Output: 9 (3 rows * 3 columns = 9 elements)
print(df.shape)  # Output: (3, 3) (3 rows, 3 columns)

9
(3, 3)

in this example, the DataFrame df has 3 rows and 3 columns. df.size returns 9, which represents the total number of elements in the DataFrame. On the other hand, df.shape returns the tuple (3, 3), indicating that the DataFrame has 3 rows and 3 columns.

In summary, DataFrame.size() provides the total number of elements in the DataFrame, while DataFrame.shape() returns a tuple with the number of rows and columns in the DataFrame.

Q6. Which function of pandas do we use to read an excel file?

read_excel()

You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [3]:
import pandas as pd

def extract_username(df):
    df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
    return df

In [4]:
df = pd.DataFrame({'Email': ['john.doe@example.com', 'jane.smith@example.com', 'alex@gmail.com']})
df = extract_username(df)
print(df)

                    Email    Username
0    john.doe@example.com    john.doe
1  jane.smith@example.com  jane.smith
2          alex@gmail.com        alex

You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [25]:
import pandas as pd

def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

In [26]:
df = pd.DataFrame({'A': [2, 8, 6, 4, 10],
                   'B': [7, 5, 9, 3, 12],
                   'C': [1, 2, 3, 4, 5]})
selected_df = select_rows(df)
print(selected_df)

   A  B  C
1  8  5  2
2  6  9  3

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [ ]:
df3=pd.DataFrame({'values':[10,20,30,40,50]})

In [28]:
df3

   values
0      10
1      20
2      30
3      40
4      50

In [38]:
df3['values'].mean()

30.0

In [39]:
df3['values'].sum()

150

In [40]:
df3['values'].median()

30.0

In [41]:
df3['values'].std()

15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [3]:
import pandas as pd

dates = ['2023-07-01', '2023-07-02', '2023-07-03', '2023-07-04', '2023-07-05', '2023-07-06', '2023-07-07', '2023-07-08', '2023-07-09']
sales = [10, 15, 12, 20, 18, 16, 22, 25, 19]

df = pd.DataFrame({'Date': dates, 'Sales': sales})
df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime

df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

print(df)

        Date  Sales  MovingAverage
0 2023-07-01     10      10.000000
1 2023-07-02     15      12.500000
2 2023-07-03     12      12.333333
3 2023-07-04     20      14.250000
4 2023-07-05     18      15.000000
5 2023-07-06     16      15.166667
6 2023-07-07     22      16.142857
7 2023-07-08     25      18.285714
8 2023-07-09     19      18.857143

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [8]:
import pandas as pd

def add_weekday_column(df):
    df['Weekday'] = pd.to_datetime(df['Date']).dt.day_name()
    return df
# Sample DataFrame
data = {'Date': ['2023-07-01', '2023-07-02', '2023-07-03', '2023-07-04', '2023-07-05']}

df = pd.DataFrame(data)

# Call the function to add the 'Weekday' column
df = add_weekday_column(df)

print(df)

         Date    Weekday
0  2023-07-01   Saturday
1  2023-07-02     Sunday
2  2023-07-03     Monday
3  2023-07-04    Tuesday
4  2023-07-05  Wednesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.